---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceDisplayPatternLines
source: html/de9907e0-b772-7da9-e94a-3af152a30e44.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceDisplayPatternLines Property

"Pattern Lines"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfaceDisplayPatternLines { get; }
```